#pragma once
#include<iostream>
#include<string>
using namespace std;
typedef std::uint64_t hash_t;
constexpr hash_t prime = 0x100000001B3ull;
constexpr hash_t basis = 0xCBF29CE484222325ull;
const char AirPorts[199][30] = { "","乌鲁木齐国际机场","喀什机场","和田机场","库尔勒机场","克拉玛依机场","吐鲁番交河机场","哈密机场","阿克苏温宿机场","库车龟兹机场","布尔津喀纳斯机场","西宁曹家堡机场","格尔木机场","玉树巴塘机场","海西德令哈机场","海西花土沟机场","果洛玛沁机场","银川河东国际机场","中卫沙坡头机场","固原六盘山机场","兰州中川国际机场","嘉峪关机场","敦煌机场","金昌金川机场","张掖甘州机场","天水麦积山机场","庆阳西峰机场","甘南夏河机场","西安咸阳国际机场","延安二十里堡机场","榆林榆阳机场","安康机场","汉中城固机场",
"贵阳龙洞堡国际机场","荔波机场","黎平机场","安顺黄果树机场","兴义万峰林机场","铜仁凤凰机场","遵义新舟机场","毕节飞雄机场","凯里黄平机场","六盘水月照机场","成都双流国际机场","绵阳南郊机场","西昌青山机场","康定机场","宜宾菜坝机场","达州河市机场","南充高坪机场","攀枝花保安营机场","九寨黄龙机场","泸州蓝田机场","拉萨贡嘎机场","林芝米林机场","昌都邦达机场","阿里昆莎机场","日喀则和平机场","昆明长水国际机场","丽江三义国际机场","迪庆香格里拉机场","腾冲驼峰机场","文山普者黑机场","临沧博尚机场","普洱思茅机场",
"保山云瑞机场","芒市机场","昭通机场","重庆江北国际机场","万州五桥机场","黔江武陵山机场","三亚凤凰国际机场","海口美兰国际机场","琼海博鳌机场","三沙永兴机场","广州白云国际机场","深圳宝安国际机场","珠海金湾机场","揭阳潮汕国际机场","佛山沙堤机场","湛江机场","梅县长岗岌机场","惠州平潭机场","南宁吴圩国际机场","桂林两江国际机场","北海福成机场","柳州白莲机场","百色巴马机场","梧州长洲岛机场","河池金城江机场","长沙黄花国际机场","张家界荷花机场","怀化芷江机场","永州零陵机场","常德桃花源机场","衡阳南岳机场","邵阳武冈机场",
"武汉天河国际机场","宜昌三峡机场","襄阳刘集机场","恩施许家坪机场","神农架红坪机场","十堰武当山机场","郑州新郑国际机场","南阳姜营机场","洛阳北郊机场","南昌昌北国际机场","赣州黄金机场","景德镇罗家机场","井冈山机场","宜春明月山机场","上饶三清山机场","青岛流亭国际机场","济南遥墙国际机场","烟台蓬莱国际机场","威海大水泊机场","潍坊机场","临沂沭埠岭机场","东营胜利机场","济宁曲阜机场","日照山字河机场","厦门高崎国际机场","福州长乐国际机场","武夷山机场","泉州晋江国际机场","连城冠豸山机场","三明沙县机场","合肥新桥国际机场","黄山屯溪国际机场",
"安庆天柱山机场","阜阳西关机场","池州九华山机场","杭州萧山国际机场","宁波栎社国际机场","温州龙湾国际机场","台州路桥机场","舟山普陀山机场","义乌机场","衢州机场","南京禄口国际机场","常州奔牛国际机场","南通兴东国际机场","连云港白塔埠机场","徐州观音国际机场","盐城南洋机场","无锡硕放机场","淮安涟水机场","扬州泰州国际机场","上海浦东国际机场","上海虹桥国际机场","哈尔滨太平国际机场","鸡西兴凯湖机场","伊春林都机场","大庆萨尔图机场","漠河古莲机场","佳木斯东郊机场","牡丹江海浪机场","齐齐哈尔三家子机场","黑河瑷珲机场","加格达奇机场","长春龙嘉国际机场","白山长白山机场","延吉朝阳川机场","通化三源浦机场","白城长安机场","大连周水子国际机场","沈阳桃仙国际机场","朝阳机场","丹东浪头机场","锦州锦州湾机场","鞍山腾鳌机场","长海大长山岛机场","营口兰旗机场","呼和浩特白塔机场","通辽机场","包头二里半机场","呼伦贝尔海拉尔机场",
"赤峰玉龙机场","鄂尔多斯国际机场","二连浩特赛乌素机场","阿尔山伊尔施机场","乌海机场","锡林浩特机场","太原武宿国际机场","运城张孝机场","长治王村机场","吕梁大武机场","大同云冈机场","忻州五台山机场","临汾乔李机场","石家庄正定国际机场","秦皇岛北戴河机场","唐山三女河机场","邯郸机场","张家口宁远机场","承德普宁机场","北京首都国际机场","北京南苑机场","天津滨海国际机场"
};
hash_t hash_(char const* str);
constexpr hash_t hash_compile_time(char const* str, hash_t last_value = basis);
int PlaceToNum(const char Place[30]);
